Вводные:

директор сказал, что хочет дата кволити на каждую витрину
продакты накидали реестр из 1000 проверок
пока что этот инструмент позиционируется только как инструмент мониторинга
процесса реакции на ошибки в данных нет
ответственных за исправление ошибок нет
сроки исправления ошибок неизвестны
для проверок не определены пороги (% записей в таблице, когда все хорошо/средне/плохо)
для проверок нет статуса (нужно / пока не нужно / архив)
Что непонятно:

сроки разработки не обозначены и не согласованы (???)
не понятен приоритет продукта и план развития до конца года
непонятно, где именно запускать проверки (предположение - кликхаус, т.к. ближе к пользователям)
непонятно, надо ли хранить ключи/плохие записи
непонятно, кто несет ответственность за плохие данные
Что уже есть:

реестр проверок (DQ Периметр (КХД).xlsx)
какие-то проверки для некоторых витрин уже есть и запускаются в проде (но нет реестра витрин с проверками)
Риски (ближайшие):

метрики есть, но реакции на них нет (ошибки не исправляются)
вероятны просадки производительности
реестр проверок разъедется с sql кодом/git
проверки накладываются на таблицы кликхауса, но над ними еще сверху есть BI-логика в суперсете, вероятны ложные результаты
не понятно, кто из бизнеса (реального потребителя) заинтересован в этом инструменте
Критерий успешности MVP:

???
?????
На данном этапе MVP не требуется разработка процессов dq, можно ограничиться созданием инструмента, который будет запускать SQL-запросы из шаблона реестра проверок.



dq_sd0001	есть Sailed. L. Port, но нет коносамента РФ	проверка для поставок с одним плечом: есть дата ухода судна Sailed. L. Port, но нет коносамента РФ	SD	1-business	2-warning	dm.dq_sd0001	dm_view.sb_wuc	проверка для поставок с одним плечом: есть дата ухода судна Sailed. L. Port, но нет коносамента РФ	если "Sailed L.Port" SD.000058 <> "пусто" 
и "Группа коносамента" SD.000040 = "пусто"
и ("Наличие Иностранный склад 2" SD.000485 = "пусто" или «Базис поставки» SD.000067 <> параметру INCO1CIF или INCO1CIP, или INCO1FOB программы /RUSAL/MK_TRACK_ROUTE) 
и «Плановый порт выгрузки 2» ="«пусто"	ДСБ (Понятовская)
dq_sd0002	есть Дата окончания хранения на ин. складе, но нет коносамента ин. порта или наоборот	проверка для поставок со вторым плечом: есть Дата окончания хранения на ин. складе, но нет коносамента ин. порта или наоборот	SD	1-business	2-warning	dm.dq_sd0002	dm_view.sb_wuc	проверка для поставок со вторым плечом: есть Дата окончания хранения на ин. складе, но нет коносамента ин. порта или наоборот	если "Окончание хранение склад 2" SD.000178 <> "пусто"
и "Группа коносамента в ин.порту" SD.000047 = "пусто"
и "Наличие Иностранный склад 2" SD.000485 <> "пусто"	ДСБ (Понятовская)
dq_sd0003	Дата готовности раньше даты начала хранения	Дата готовности раньше даты начала хранения	SD	1-business	2-warning	dm.dq_sd0003	dm_view.sb_wuc	Дата готовности раньше даты начала хранения	Warnings 
если "Дата готовности к релизу" SD.000344 < "Начало хранения склад 2" SD.000177
и «Дата готовности к релизу»SD.000344 >= «Дата коносамента в ин.порту» SD.000049
иначе Warnings 
если "Дата готовности к релизу" SD.000344 < "Дата начала хранения ин. склад" SD.000175
и ("Наличие Иностранный склад 2" SD.000485 = "пусто" или «Базис поставки» SD.000067 <> параметру INCO1CIF или INCO1CIP, или INCO1FOB программы /RUSAL/MK_TRACK_ROUTE) 
и «Плановый порт выгрузки 2» ="«пусто"
и "Наличие Иностранный склад" <> "пусто" SD.000483	ДСБ (Понятовская)
dq_sd0004	Дата реализации есть, а окончания хранения - нет	Проверка для поставок через склад: Дата реализации есть, а окончания хранения - нет	SD	1-business	2-warning	dm.dq_sd0004	dm_calc.sd_sales_main_scm	Проверка для поставок через склад: Дата реализации есть, а окончания хранения - нет	Озеро данных
Warnings 
если "Статус Реализации" = 'Yes'
и "Наличие Иностранный склад 2" SD.000485 <> "пусто"
и "Окончание хранение склад 2" SD.000178 = "пусто"
иначе Warnings 
если "Статус Реализации" = 'Yes'
и ("Наличие Иностранный склад 2" SD.000485 = "пусто" или «Базис поставки» SD.000067 <> параметру INCO1CIF или INCO1CIP, или INCO1FOB программы /RUSAL/MK_TRACK_ROUTE) 
и «Плановый порт выгрузки 2» = "«пусто"
и "Наличие Иностранный склад" <> "пусто" SD.000483	ДСБ (Понятовская)
dq_sd0005	дельта Supply chain	Просмотр измененных данных в дашборде metal in suply chain между двумя выбранными датами	SD	2-technical	3-info	dm.dq_sd0005	dm.sb_wuc, dm.sb_wuc_backup	Просмотр измененных данных в дашборде metal in suply chain между двумя выбранными датами	Записать разницу между данными в витрине dm.sb_wuc за сегодня и вчера по ключам:
dt_report,
 delivery_number_sales,
 batch,
 uni,
 weight_nk,
 "location",
 business_location_name,
 warehouse_shipment_type_name.

Также каждый день сохранить общие суммы по аналогии с дашбордом:
total_weight_net,
 total_including_smelters_wh_weight_net,
total_shipped_metal_in_inventory_weight_net,
total_not_yet_delivered_metal_weight_net,	ДСБ (Понятовская)
dq_sd0006	Связанные таблицы _EXP	Проверка на целостность данных после ночного обновления в таблицах _EXP	SD	2-technical	1-critical	dm.dq_sd0006	ods.map_zmk_track_exp_keys	Проверить, что поставки присутствуют во всех связанных таблицах	После ночного обновления Озера данных, проверять что все VBELN_P которые присутствуют в ZMK_TRACK_EXP01, так же должны быть в таблицах:
ZMK_TRACK_EXP02
ZMK_TRACK_EXP03
ZMK_TRACK_EXP04	ДИТ (Михалева)
dq_sd0007	Проверка полной себестоимости в USD/тн	Полная себестоимость USD/тн меньше 1500 USD/тн	SD	1-business	2-warning	dm.dq_sd0007	dm_view.sales_margin	Провека значений полной себестоимости на тонну	Warnings
если "Полная себестоимость USD/тн" SD.000745 "cost_price" < 1500 И вид фактуры ZSD324K_BI -FKART НЕ содержится в параметре I_FKARTR	ДКБ (Петрова)
dq_sd0008	Проверка рентабельности в %	Рентабельность полной себестоимости больше 100% или отрицательная	SD	1-business	2-warning	dm.dq_sd0008	dm_view.sales_margin	Провека значений рентабельности полной себестоимости	Warnings
если  ("Рентабельность полной себестоимости, %" SD.000748 > 100  И вид фактуры ZSD324K_BI -FKART НЕ содержится в параметре I_FKARTR)
или если "Рентабельность полной себестоимости, %" SD.000748 "margin_percentage" < 0 И вид фактуры ZSD324K_BI -FKART НЕ содержится в параметре I_FKARTR	ДКБ (Петрова)
dq_sd0009	Проверка объемов поставок (сверка объемов внутри дня)	Проверка объемов поставок, пришедших после ночного обновления данных (сверка объемов внутри дня)	SD	1-business	1-critical	dm.dq_sd0009	dm_view.sb_wuc	Проверка объемов поставок, пришедших после ночного обновления данных (сверка объемов внутри дня)	сверка внутри даты среза:
при dt_report = текущий день если сумма по полю SD.000032 Вес нетто на 10% больше, чем  SD.000032 Вес нетто при dt_report = текущий день - 1, то выводить ошибку 
пример: после ночного обновления 29.01 проверяем, какие данные у нас пришли на 29.01 и 28.01. Если больше чем 10% разница, то ошибка.	ДИТ (Михалева)
dq_sd0010	Проверка объемов поставок (сверка объемов за 2 дня)	Проверка объемов поставок, пришедших после ночного обновления данных (сверка объемов за 2 дня)	SD	1-business	1-critical	dm.dq_sd0010	dm_view.sb_wuc & dm_calc_sb_wuc_backup	Проверка объемов поставок, пришедших после ночного обновления данных (сверка объемов за 2 дня)	сверка объемов за 2 дня (2 среза данных):
при dt_report = текущий день (и срез текущего дня) если сумма по полю SD.000032 Вес нетто на 10% больше, чем  SD.000032 Вес нетто при dt_report = текущий день - 1 (и срез предыдущего дня), то выводить ошибку 
пример: после ночного обновления 29.01 проверяем, какие данные у нас пришли 29.01 на 29.01 и данные, которые пришли в предудущий день на 28.01. Если больше чем 10% разница, то ошибка.	ДИТ (Михалева)
dq_sd0011	Проверка заполнения наименования завода	Если есть код завода, значит должно быть и навименование завода	SD	2-technical	2-warning	dm.dq_sd0011	dm_calc.sd_sales_main_scm	Если есть код завода, значит должно быть и навименование завода	Если SD.000006 "Завод производитель (код)" plant_producer_code не пусто, то поле должно быть заполнено	ДИТ (Михалева)

dq_cs0001	Проверка: у сообщения PR нет метки "Простой"	Проверка: у сообщения PR нет метки "Простой"	CS	2-technical	2-warning	 	stg.TORO2_NTF_HDR	Проверка: у сообщения PR нет метки "Простой". Метка должна быть всегда.	Если TORO2_NTF_HDR-QMART = 'PR', то должно быть TORO2_NTF_HDR-MSAUS = 'X'
dq_cs0002	Проверка на заполненность поля «окончание неисправности» при установке статуса СОЗА или УСТР	Проверка: у сообщения установлен статус СОЗА или УСТ, но не заполнено поле «окончание неисправности»	CS	1-business	2-warning	 	stg.TORO2_NTF_HDR	Проверка на заполненность поля «окончание неисправности» при установке статуса СОЗА или УСТР	Если TORO2_NTF_HDR-STTXT like '%СОЗА%' or TORO2_NTF_HDR-ASTXT like '%УСТР%', то TORO2_NTF_HDR-AUSBS_DT is not null
