Требования к MVP по DQ


Определение функциональности MVP

Требования к реестру проверок

Выровненная таблица с согласованной структурой для каждого направления
Предусмотреть автоматизацию способа перевода проверок из реестра проверок в общий репозиторий (со *, пока вручную)
Требования к реализации проверок

Проверки должны сохраняться в GIT
Проверки должны иметь статусную модель включена/выключена/запланирована
Проверки должны иметь возможность запускаться по расписанию и вручную
Предусмотреть возможность ввода sql-запроса в качестве проверки
Результаты проверок должны логироваться, необходимо сохранять как и общее количество строк в таблице, так и количество положительных срабатываний
Необходимо переиспользовать текущий фреймворк технических проверок под MVP (в дальнейшем проверить альтернативы)
Требования к отображению результатов проверок

Финальные витрины с проверками в отображаются в superset
Участники команды КХД должны иметь возможность просмотра статусов проверок (включена/выключена)
Участникам команды КХД должна приходить рассылка о результатах проверок, предусмотреть добавление в рассылку заинтересованных бизнес-пользователей
Требования к процессу разработки проверок

Внесение изменений в реестр проверок идет только через аналитика
Проверки должны валидироваться лидами аналитиков
Проверки должны тестироваться на dev-окружении
Вынос проверок на продуктив идет только через общий репозиторий кода
Включать и выключать проверки могут только инженеры данных по заявке
