Обязательные правила при загрузке объектов в ClickHouse
@all
Важно!
1️⃣ DAG’и для ClickHouse
Для загрузки объектов в ClickHouse создаётся отдельный DAG для каждого объекта.
Все новые DAG’и по умолчанию создаются в статусе PAUSED.
Это означает, что DAG не будет выполняться, пока его не включат вручную.
➡️ После релиза необходимо:
проверить корректность новых DAG’ов;
включить их в работу.
Для удобства навигации все DAG’и, относящиеся к ClickHouse, помечены тегом METACLICKHOUSE.
Дополнительно добавлен пункт в инструкцию по раскатке релизов:
👉 https://yt.rusal.ru/articles/DWH-A-1009/Instrukciya-po-raskatke-reliza
2️⃣ Работа с ветками в Git
При выполнении любой задачи обязательно создаётся отдельная ветка, в рамках которой ведётся вся активность.
📌 Правило именования ветки:
имя ветки должно совпадать с номером задачи в YouTrack.
Пример:
Задача:
https://yt.rusal.ru/issue/DWH-10012/Ispravlenie-spravochnikov-dictstg.TORO2FLCHDR-dictstg.TORO2EQPHDR
Имя ветки:
DWH-10012
Это позволяет:
быстро понять, в рамках какой задачи вносились изменения;
упростить разбор инцидентов и регрессий при падениях после релиза.
3️⃣ Обязательные системные поля
Во всех объектах (таблицы, представления) обязательно должны присутствовать системные поля:
dttm_inserted  TIMESTAMP DEFAULT now() NOT NULL,
dttm_updated   TIMESTAMP DEFAULT now() NOT NULL,
job_name       VARCHAR(60) DEFAULT 'airflow' NOT NULL,
deleted_flag   BOOLEAN DEFAULT false NOT NULL
⚠️ Аналитик может не указывать эти поля в своём прототипе.
Доработка и добавление системных полей — зона ответственности инженера.
Это требование распространяется:
на таблицы;
на представления (view).
